openFoamRepoDev/tutorials/lagrangian/reactingParcelFoam/rectangularChannel/0.orig/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.8;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }

    outlet
    {
        type            inletOutlet;
        value           uniform 0.8;
        inletValue      uniform 0.8;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 0.8;
    }
}


// ************************************************************************* //
